Revit 2027 API
IFCGuidKey.GetHashCode Method
 Returns the hash code for this IFCGuidKey
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
public:
virtual int GetHashCode() override
abstract GetHashCode : unit -> int
override GetHashCode : unit -> int
Return Value
Int32
 A 32-bit signed integer hash code.
See Also
Reference
IFCGuidKey Class
Autodesk.Revit.DB.IFC Namespace